Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList`1{Autodesk.Revit.DB.FilterRule})
Checks that the parameters of the given rules are valid for the given set of categories.
aDocument:
The document containing the filter, categories, and parameters involved in this validation.
categories:
The set of categories against which to check the rule parameters.
rules:
The rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(System.Collections.Generic.IList`1{Autodesk.Revit.DB.FilterRule})
Checks that the parameters of the given rules are valid for this filter's categories.
rules:
The rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.SetRules(System.Collections.Generic.IList`1{Autodesk.Revit.DB.FilterRule})
Sets the rules, all of which must be satisfied for a given
element to pass this filter.
Remarks:
The rules are applied in the order given.  If an element fails
to pass a certain rule, no further testing is done.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the given rules refers to a parameter that does not apply to this filter's categories.
-or-
One of the rules in the given array is null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.SetCategories(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the categories admitted by this filter.
Remarks:
Testing that an element's category is a member of this set is,
essentially, the first rule of the filter.
Changing the set of categories will clear the element's filter rules.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList`1{Autodesk.Revit.DB.FilterRule})
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
rules:
The rules for the new ParameterFilterElement.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
The given value for name is already in use as a filter element name.
-or-
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011